{"pages":[{"title":"404 HATA","text":"","link":"/404.html"}],"posts":[{"title":"Centos Update Komutu","text":"Bazı uygulamaları çalıştırabilmemiz için son sürüm işletim sistemi istemektedir. Bu konumuzda güncelleme komutunu çalıştırdıktan sonra centos sistemimizi en son sürüme yükseltebileceğiz. Centos Güncelleme Komutu : 1yum install update -y","link":"/centos-update-komutu/"},{"title":"No Such File or Directory Hatası ve Çözümü","text":"Sisteminiz 64 bit ve kullandığınız uygulama veya servis 32 bit ile çalışıyordur. Bu hatanın çözümü glibc 32 bit paketini kurmaktır. Kurduğunuzda başarılı bir şekilde uygulamanızı veya servisini çalıştırabileceksiniz. Çözüm Yolu: Linux üzerinden ilgili glibc paketini yüklenilir. Eğer linux deposu kullanmıyor ise glibc rpm paketi üzerinden işletim sisteminize ait paketi bulup kurarak sorunu çözebilirsiniz. CentOS/RedHat/Fedora/Suse/Mandriva İşletim Sistemleri İçin : 1yum -y install glibc.i686 Debian/Ubuntu/Mint/Crunchbang İşletim Sistemleri İçin: 1apt-get install ia32-libs İşletim sistemleri ve komutları karşısındadır. Kullandığınız işletim sistemine göre bu komutları girdiğinizde sorun çözülmüş olacaktır.","link":"/bad-elf-interpreter-no-such-file-or-directory-hatasi-ve-cozumu/"},{"title":"Centos Wget Komutu","text":"Çok basit gibi gelen ama işinize yarayacağı sırada akıllara gelmeyen bir kod olduğundan paylaşmak istedim. 1yum install wget -y Wget Nedir ? Wget sunucuya uzaktan dosya indirmenizi sağlan bir modüldür. Örneğin apache,lampp kurulumu yapacağınız sırada uzaktan indirip konfigürasyon yapabilmenizi sağlar.","link":"/centos-wget-komutu/"},{"title":"Firewall Nedir?","text":"Genel olarak, bir bilgisayar güvenlik duvarı, özel bir ağa ya da özel bir ağdan yetkisiz erişimi engelleyen bir yazılım programıdır. Güvenlik duvarları, LAN veya Internet gibi bir ağa bağlı bilgisayarların güvenliğini artırmak için kullanılabilecek araçlardır. Ağınız için kapsamlı bir güvenlik çerçevesinin ayrılmaz bir parçasıdır. Bir güvenlik duvarı, bilgisayarınızda izinli olup olmadığının belirlenmesi için, güvenlik duvarının her iki tarafına ulaşan – her bir “paket” bilgisini bilgisayardan gelen veya giden bir “paket duvarı” nı inceleyen bir “kod duvarı” kullanarak bilgisayarınızı kesinlikle Internet’ten yalıtır.Güvenlik duvarları, ne tür sistem işlevlerinin ve işlemlerinin ağ kaynaklarına erişime sahip olduğu konusunda ayrıntılı denetim sağlayarak güvenliği daha da artırabilme özelliğine sahiptir. Bu güvenlik duvarları, trafiğe izin vermek veya reddetmek için çeşitli imzaları ve ana bilgisayar koşullarını kullanabilir. Karmaşık olmasına rağmen, güvenlik duvarlarının kurulumu, kurulumu ve çalıştırılması nispeten kolaydır. Çoğu insan bir güvenlik duvarının ağda yüklü bir cihaz olduğunu ve ağ segmentinden geçen trafiği kontrol ettiğini düşünmektedir. Güvenlik Duvarı Ne Yapar ?# Temel olarak, güvenlik duvarlarının aşağıdaki görevleri yerine getirebilmesi gerekir: • Kaynakları savunabilme• Ağ trafiğini yönetebilme ve kontrol edilebilme• Olaylar ile ilgili loglar tutabilme ve kaydedebilme.Gibi bir çok örnek verilebilir.","link":"/firewall-nedir/"},{"title":"Linux SSH Portu Değiştirme","text":"Uyarı : Yeni belirlemiş olduğunuz ssh portunuzun bilinmiş veya engellenmiş portlar ile çakışmaması için kontrollerinizi gerçekleştiriniz. İlk olarak ssh bağlantınızı gerçekleştirin ve root olarak giriş yapın. Sonrasında şu komutu uygulayalım. Düzenlenmesi Gereken Dosya Yolu1vi /etc/ssh/sshd_config Şu satırı bulun. 1# Port 22 Satırda bulunan # işaretini kaldırıp ve portumuzu belirliyoruz. Örnek aşağıda gösterilmiştir. Yapılması Gereken Düzenleme1Port 40 Bu değişikliklerin aktif olabilmesi için ssh servisini yeniden başlatmamız gerekiyor. Servisi Resetleme Komutu1service sshd restart Ardından yeni port ile bağlantı kurabiliriz.","link":"/linux-ssh-portu-degistirme/"},{"title":"SteamCMD Kurulumu","text":"Öncelikle steamcmd kurarken hata almamak için sistemimizdeki paketleri ve sistemimizi güncellememiz gerekiyor. Ayrıca düzgün bir kurulum için bir kullanıcı hesabı oluşturmamız gerekiyor. Centos 7 İçin Kurulum Ubuntu / Debian x64 İçin Kurulum SteamCMD İle Server Kurmak SteamCMD İle Giriş Sunucu Konumu Oyun Sunucusu Ayarları NOT : RESİM TEMSİLİ DEĞİLDİR. Centos 7 İçin Kurulum#Sistem ve Paket Güncelleme Komutları 1yum clean all 1yum update -y 1yum upgrade -y 1adduser steam (Belirlemiş olduğunuz kullanıcı adınızı yazabilirsiniz.) 1yum install glibc.i686 libstdc++.i686 -y Ubuntu / Debian x64 İçin Kurulum#1apt-get update -y 1apt-get upgrade -y 1adduser steam 1apt-get install lib32gcc1 Peki bu kullanıcıya nasıl geçiş yapacağız ? 1su -ls /bin/bash steam Oluşturma komutunda steam olarak belirttiğim için steam yazıyorum. 1cd ~ Başarılı bir şekilde steam adlı kullanıcıya geçiş yapmış bulunmaktayız. Geriye steamcmd dosyalarını kurmak kaldı. 1wget https://steamcdn-a.akamaihd.net/client/installer/steamcmd_linux.tar.gz Dosyaları tar.gz ‘den çıkarıyoruz. 1tar xf steamcmd_linux.tar.gz Şimdi belirttiğim komut ile steamcmd başlatıp kendisi otomatik olarak dosyaları indirmeye başlayacaktır. 1./steamcmd.sh SteamCMD İle Server Kurmak#Kurulumumuz başarılı bir şekilde gerçekleşti ise server kurmaya hazırız demektir. Kurmakta sorun yaşayan arkadaşlar yorum kısmında hatalarını belirtebilirler elimden geldiğince yardımcı olmaya çalışacağım. SteamCMD İle Giriş#Steamcmd başlattık şimdi giriş yapmamız gerekecek. 1login anonymous Veya 1login kendisteamkullaniciadiniz Şimdi arkadaşlar sunucusunu kuracağımız oyuna sahip isek kendi kullanıcı adımız ve şifremiz ile giriş yapmamız gerekicek. Giriş yaparken steam guard şifresi vs. isteyecektir. Örneğin bazı oyunlar için anonymous olarak giriş yaptığımızda dosyaları indirmemektedir sebebi ise sahip olunan bir hesap ile giriş yapmamış olmamızdır. Sunucu Konumu#Kuracağımız klasörü belirtiyoruz. 1force_install_dir ./klasörünkonumu Oyun Sunucusu Ayarları#Belirtmiş olduğumuz klasöre hangi oyunun sunucusunu kuracak isek oyunun idsini almamız gerekir. Steamde oyun mağazına gittiğinizde url adresinin sonunda rakamlar olacak. Rakamlar o oyunun idsini belirtmektedir. Örnekte 740 (CSGO) İdsidir. 1app_update 740 validate 740 yerine kuracağınız oyunun idsini yazmanız gerekicek. Ve bu şekilde oyun dosyalarımızı steamcmd ile indirebiliriz. Oyun sunucularının başlatma komutları birbirinden farklı olabiliyor. Öğrenmek için oyunların kendi websitesi üzerinden bilgi edinebilirsiniz. Umarım anlatabilmişimdir. Sorularınız olduğunda yazmaktan çekinmeyin sağlıklı günler diliyorum.","link":"/steamcmd-kurulumu/"},{"title":"T-SQL Not Puanlama Örneği","text":"Örneğimizdeki amaç sınavlardan aldığımız notun hangi puana denk geldiğini bulmaktır. Örneğin 50 aldığımızı varsayalım karnemize 2 olarak yansıyacaktır. Notu girip bunu öğrenebileceğimiz kodlar aşağıdaki gibidir. T-SQL Kodu12345678910111213Declare @notu INT = 50If @notu&gt;=0 AND @notu &lt;= 44 Print '1-Bir'Else If @notu &gt;=45 AND @notu &lt;=54 Print '2-İki'Else If @notu&gt;=55 AND @notu&lt;=69 Print '3-Üç'Else If @notu&gt;=70 AND @notu&lt;=84 Print '4-Dört'Else If @notu&gt;=85 AND @notu&lt;=100 Print '5-Beş'Else Print 'Not 0-100 aralığında değil!!!'","link":"/t-sql-not-puanlama-ornegi/"},{"title":"T-SQL Sayının Tek Çift Olduğunu Bulan Örnek","text":"T-SQL ‘de değişkene atadığımız sayının tek veya çift olduğunu bulan program aşağıdaki gibidir. T-SQL Kodu12345678Declare @sayi INTSet @sayi = 52If @sayi % 2 = 0 Print 'Sayı çifttir.'Else Print 'Sayı tektir'Go","link":"/t-sql-sayinin-tek-cift-oldugunu-bulan-ornek/"}],"tags":[],"categories":[{"name":"Linux","slug":"Linux","link":"/kategori/Linux/"},{"name":"Bilişim Teknolojileri","slug":"Bilisim-Teknolojileri","link":"/kategori/Bilisim-Teknolojileri/"},{"name":"Veritabanı","slug":"Veritabani","link":"/kategori/Veritabani/"}]}